package org.example.bot_25_06_25;


public class Service {
    public String gitInfo(){
        return "Git - это распределенная система контроля версий, позволяет отслеживать изменения в коде, " +
                "работать в команде, создавать backUp, " +
                "экспериментировать с новыми функциями через " +
                "новые ветки и многое другое.";
    }

    public String github(){
        return "GitHub - Это платформа которая позволяет сохранять репозитории т.е проекты в облаке."
                + "GitHub -интегрируется с Git, предоставляет удобный интерфейс для просмотра изменений, для обсуждения кода, Ca-Cd и т.п";
    }

}
